import Image from "next/image";
type Props = {
    logo?: string;
}
const About: React.FC<Props> = props => {

    return (
        <section className="max-w-container m-auto px-3 max-xl:p-5 mb-5 sm:mb-10" >
            {props.logo && <Image
                src={props.logo}
                alt="هتل بان"
                width={157}
                height={48}
                className="w-auto h-12 mb-3 lg:mb-6"
            />}

            <p>
                سایت هتل‌بان با هدف آشنایی بیشتر کاربران با دنیای شگفت‌انگیز گردشگری و سفر ایجاد شده است. این سایت بستری است برای علاقه‌مندان به کشف اطلاعات مفید، خواندن مطالب جذاب، و به‌روزترین اخبار در زمینه گردشگری، فرهنگ، و مقاصد دیدنی. ما در هتل‌بان تلاش می‌کنیم تا با ارائه مقالات متنوع و الهام‌بخش، شما را در مسیر برنامه‌ریزی سفرهای آینده‌تان یاری کنیم. از داستان‌های جذاب درباره شهرها و کشورهای مختلف گرفته تا نکات کاربردی برای سفر، همه و همه در یک مکان جمع‌آوری شده‌اند تا تجربه‌ای متفاوت از گردشگری دیجیتال را به شما ارائه دهیم.
                با هتل‌بان، مقصد بعدی شما فقط یک قدم نزدیک‌تر است!
            </p>
        </section>
    )
}

export default About;